In this project I'll explore the file "Superstore" using different Python libraries, like Pandas and Seaborn. I'll create data visualizations to find patterns and insights in the data.

In [27]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_excel('../data/superstore.xlsm')
data.loc[0:5,['Segment', 'Country','City',]]

     Segment        Country             City
0   Consumer  United States        Henderson
1   Consumer  United States        Henderson
2  Corporate  United States      Los Angeles
3   Consumer  United States  Fort Lauderdale
4   Consumer  United States  Fort Lauderdale
5   Consumer  United States      Los Angeles

In [9]:
data[~(data['Country'] == 'United States')]

Empty DataFrame
Columns: [Row ID, Order ID, Order Date, Ship Date, Ship Mode, Customer ID, Customer Name, Segment, Country, City, State, Postal Code, Region, Product ID, Category, Sub-Category, Product Name, Sales, Quantity, Discount, Profit]
Index: []

[0 rows x 21 columns]

There is no orders outside the United States.
There are non-null values in any column

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   datetime64[ns]
 3   Ship Date      9994 non-null   datetime64[ns]
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9994 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9994 non-null   int64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9994 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9994 non-null   float64
 20  Profit         9994 non-null   float64
dtypes: datetime64[ns](2), float64(3), int64(3), object(13)
memory usage: 1.6+ MB

In [29]:
data.describe(include=[np.number])

,Row ID,Postal Code,Sales,Quantity,Discount,Profit
count,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000,9994.000000
mean,4997.500000,55190.379428,229.858001,3.789574,0.156203,28.656896
std,2885.163629,32063.693350,623.245101,2.225110,0.206452,234.260108
min,1.000000,1040.000000,0.444000,1.000000,0.000000,-6599.978000
25%,2499.250000,23223.000000,17.280000,2.000000,0.000000,1.728750
50%,4997.500000,56430.500000,54.490000,3.000000,0.200000,8.666500
75%,7495.750000,90008.000000,209.940000,5.000000,0.200000,29.364000
max,9994.000000,99301.000000,22638.480000,14.000000,0.800000,8399.976000

Testing apply function

In [24]:
data_sample = data.loc[0:5,['Segment', 'Country','City','Sales','Discount','Profit']]
data_sample['Profit_2'] = data_sample.apply(lambda x: x['Profit'] if x['City'] == 'Henderson' else 0, axis = 1)
data_sample

,Segment,Country,City,Sales,Discount,Profit,Profit_2
0,Consumer,United States,Henderson,261.9600,0.00,41.9136,41.9136
1,Consumer,United States,Henderson,731.9400,0.00,219.5820,219.5820
2,Corporate,United States,Los Angeles,14.6200,0.00,6.8714,0.0000
3,Consumer,United States,Fort Lauderdale,957.5775,0.45,-383.0310,0.0000
4,Consumer,United States,Fort Lauderdale,22.3680,0.20,2.5164,0.0000
5,Consumer,United States,Los Angeles,48.8600,0.00,14.1694,0.0000

Using groupby function

In [30]:
data.groupby('Ship Mode')['Ship Mode'].count().sort_values(ascending=False)

Ship Mode
Standard Class    5968
Second Class      1945
First Class       1538
Same Day           543
Name: Ship Mode, dtype: int64

In [32]:
data.groupby('Segment')['Segment'].count().sort_values(ascending=False)

Segment
Consumer       5191
Corporate      3020
Home Office    1783
Name: Segment, dtype: int64

In [22]:
data.groupby(['Category','Sub-Category'])['Category'].count().sort_values(ascending=False)

Category         Sub-Category
Office Supplies  Binders         1523
                 Paper           1370
Furniture        Furnishings      957
Technology       Phones           889
Office Supplies  Storage          846
                 Art              796
Technology       Accessories      775
Furniture        Chairs           617
Office Supplies  Appliances       466
                 Labels           364
Furniture        Tables           319
Office Supplies  Envelopes        254
Furniture        Bookcases        228
Office Supplies  Fasteners        217
                 Supplies         190
Technology       Machines         115
                 Copiers           68
Name: Category, dtype: int64

Which product category has more sales?

In [11]:
data.groupby(['Category'])['Category'].count().sort_values(ascending=False)

Category
Furniture          2121
Office Supplies    6026
Technology         1847
Name: Category, dtype: int64

In [21]:
data.groupby(['Region','State','City'])['Region'].count().sort_values(ascending=False)

Region  State         City
East    New York      New York City    915
West    California    Los Angeles      747
East    Pennsylvania  Philadelphia     537
West    California    San Francisco    510
        Washington    Seattle          428
                                      ...
South   Florida       Kissimmee          1
                      Jupiter            1
        Arkansas      Springdale         1
                      Rogers             1
West    Wyoming       Cheyenne           1
Name: Region, Length: 604, dtype: int64

In [17]:
len(data['City'].unique())

531

Who is the customer that buys the most?

In [37]:
data.groupby(['Customer ID','Customer Name', 'Segment']).agg({'Sales': 'sum'}).sort_values(by='Sales',ascending=False)

                                             Sales
Customer ID Customer Name   Segment
SM-20320    Sean Miller     Home Office  25043.050
TC-20980    Tamara Chand    Corporate    19052.218
RB-19360    Raymond Buch    Consumer     15117.339
TA-21385    Tom Ashbrook    Home Office  14595.620
AB-10105    Adrian Barton   Consumer     14473.571
...                                            ...
RS-19870    Roy Skaria      Home Office     22.328
MG-18205    Mitch Gastineau Corporate       16.739
CJ-11875    Carl Jackson    Corporate       16.520
LD-16855    Lela Donovan    Corporate        5.304
TS-21085    Thais Sissman   Consumer         4.833

[793 rows x 1 columns]

Creating new columns to group by year and quarter (Q)

In [41]:
data['Quarter'] = data['Order Date'].dt.quarter
data['Year'] = data['Order Date'].dt.year
data.loc[:,['Order Date', 'Quarter', 'Year']]

     Order Date  Quarter  Year
0    2016-11-08        4  2016
1    2016-11-08        4  2016
2    2016-06-12        2  2016
3    2015-10-11        4  2015
4    2015-10-11        4  2015
...         ...      ...   ...
9989 2014-01-21        1  2014
9990 2017-02-26        1  2017
9991 2017-02-26        1  2017
9992 2017-02-26        1  2017
9993 2017-05-04        2  2017

[9994 rows x 3 columns]

In [ ]:
In which Quarter (Q) are the most sales made?

In [45]:
data.groupby(['Year']).agg({'Sales': 'sum'}).sort_values(by='Sales',ascending=False)

            Sales
Year
2017  733215.2552
2016  609205.5980
2014  484247.4981
2015  470532.5090

In [46]:
data.groupby(['Year','Quarter']).agg({'Sales': 'sum'}).sort_values(by='Sales',ascending=False)

                    Sales
Year Quarter
2017 4        280054.0670
2016 4        236098.7538
2017 3        196251.9560
2015 4        182297.0082
2014 4        179627.7302
2016 3        143787.3622
2014 3        143633.2123
2016 2        136082.3010
2017 2        133764.3720
2015 3        130259.5752
2017 1        123144.8602
2016 1         93237.1810
2015 2         89124.1870
2014 2         86538.7596
     1         74447.7960
2015 1         68851.7386